app/views/notes/show.html.erb

SELECT "chapters".* FROM "chapters" WHERE "chapters"."note_id" = ?  [["note_id", 1]]
---
<p>created by<%= get_note_created_user(@note.user_id).name %></p>
<% @note.chapters.each do |chapter| %>