app/controllers/chapters_controller.rb

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", 0]]
SELECT COUNT(*) FROM "chapters" WHERE "chapters"."note_id" = ?  [["note_id", 1]]
INSERT INTO "chapters" ("note_id", "title", "index", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["note_id", 1], ["title", "新章節"], ["index", 1], ["created_at", "2015-12-23 17:35:01.152592"], ["updated_at", "2015-12-23 17:35:01.152592"]]
---
  def create

    @note = Note.find(params[:note_id])

    @chapters = @note.chapters
    @chapter = @note.chapters.new
    @chapter.title = '新章節'
    @chapter.index = @chapters.count
    @chapter.save

SELECT  "chapters".* FROM "chapters" WHERE "chapters"."id" = ? LIMIT 1  [["id", 8]]
UPDATE "chapters" SET "title" = ?, "updated_at" = ? WHERE "chapters"."id" = ?  [["title", "rr"], ["updated_at", "2015-12-24 16:18:39.682644"], ["id", 7]]
---
  def update
    puts params
    @chapter = Chapter.find(params[:id])
    respond_to do |format|
        if @chapter.update_attributes(chapter_params)