app/controllers/home_controller.rb

SELECT "notes".* FROM "notes"
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT 1  [["uid", "1073719775978420"]]
---
  def index
    @notes = Note.all
    @user = User.all