app/controllers/notes_controller.rb

  def create
    @note = current_user.notes.create(note_params)
---
INSERT INTO "notes" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test"], ["user_id", 1], ["created_at", "2015-12-25 21:44:56.487761"], ["updated_at", "2015-12-25 21:44:56.487761"]]

  def update
    @note = Note.find(params[:id])
    respond_to do |format|
        if @note.update_attributes(note_params)
---
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "notes" SET "title" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["title", "eww"], ["updated_at", "2015-12-23 20:15:38.526674"], ["id", 1]]