app/controllers/sections_controller.rb

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @note = Note.find(params[:note_id])
    @chapter = Chapter.find(params[:chapter_id])
    @section = Section.find(params[:id])

SELECT "questions".* FROM "questions" WHERE "questions"."section_id" = ?  [["section_id", 1]]
---

    @pad_url = hackpad.uri + get_pad_url(opts)

    @section.questions.each do |question|

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "chapters".* FROM "chapters" WHERE "chapters"."id" = ? LIMIT 1  [["id", nil]]
---
  def new
    @note = Note.find(params[:note_id])
    @chapter = Chapter.find(params[:chapter_id])

SELECT  "chapters".* FROM "chapters" WHERE "chapters"."id" = ? LIMIT 1  [["id", 7]]
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "sections" ("padId", "chapter_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["padId", "LuJE3nWtiDu"], ["chapter_id", 7], ["created_at", "2015-12-24 18:15:42.072938"], ["updated_at", "2015-12-24 18:15:42.072938"]]
---
  def create
    puts "create section"

    @chapter = Chapter.find(params[:chapter_id])
    @note = Note.find(@chapter.note_id)
    if params[:mode] == 'url'
      @url_split = params[:pad_url].split('-')
      params[:section][:padId] = @url_split[@url_split.count-1]


      puts params[:section][:padId]
      @section = @chapter.sections.create(section_param)