app/views/layouts/_sidebar.html.erb

      <ul id="chapter">
          <% current_note.chapters.each do |chapter|%>
---
SELECT "chapters".* FROM "chapters" WHERE "chapters"."note_id" = ?  [["note_id", 1]]

                <ul id="section<%=chapter.id%>" class="connectedSortable">
                  <% chapter.sections.each do |section|%>
---
SELECT "sections".* FROM "sections" INNER JOIN "chapters_sections" ON "sections"."id" = "chapters_sections"."section_id" WHERE "chapters_sections"."chapter_id" = ?  [["chapter_id", 1]]